# Реализуйте алгоритм перемешивания списка.

def mix_text():
    s = ['Каждый', 'охотник', 'желает', 'знать', ',' 'где', 'сидит', 'фазан']
    for i in range(len(s)):
        s = s[2:] + s[:2]
        print(s, end=' ')
        break
mix_text()